## Plan Result (prod-video-hearings)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.enterprise.azurerm_role_definition.custom_role_definitions[&#34;Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers[&#34;HMCTS - Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_role_definition.custom_role_definitions["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_definition" "custom_role_definitions" {
      + assignable_scopes           = (known after apply)
      + description                 = "View backend health on the Application Gateway"
      + id                          = (known after apply)
      + name                        = "Application Gateway Backend Health Reader"
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/providers/Microsoft.Management/managementGroups/HMCTS"

      + permissions {
          + actions = [
              + "Microsoft.Network/applicationGateways/backendhealth/action",
            ]
        }
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.custom_role_assignments_readers["HMCTS - Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments_readers" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4a0067cc-1de2-4221-b05f-ad14f426f97d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":74,"Program":"tfcmt","SHA1":"","Target":"prod-video-hearings","Vars":{}} -->